app/Controllers/Admin/AdminAuth.php

UPDATE `users` SET `last_login` = '2025-12-04 13:30:55', `updated_at` = '2025-12-04 13:30:55'
WHERE `users`.`id` IN ('1')
---
            }

            // Update last login
            $this->userModel->update($user['id'], [
                'last_login' => date('Y-m-d H:i:s')
            ]);

INSERT INTO `user_sessions` (`user_id`, `session_token`, `device_type`, `ip_address`, `user_agent`, `expires_at`, `created_at`, ) VALUES ('1', '0b4ff8b696e94cf84917b41092662862bfced3b71ba90659d1a81aed37522985', 'web', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/142.0.0.0 Safari/537.36 Edg/142.0.0.0', '2025-12-11 13:30:55', '2025-12-04 13:30:55', '2025-12-04 13:30:55')
---
            // Create user session record
            try {
                helper('uuid');
                $this->sessionModel->insert([
                    'user_id' => $user['id'],
                    'session_token' => bin2hex(random_bytes(32)),
                    'device_type' => 'web',
                    'ip_address' => $this->request->getIPAddress(),
                    'user_agent' => $this->request->getUserAgent()->getAgentString(),
                    'expires_at' => date('Y-m-d H:i:s', strtotime('+7 days')),
                ]);

UPDATE `user_sessions` SET `expires_at` = '2025-12-01 14:35:52',  = '2025-12-01 14:35:52'
WHERE `user_id` = '1'
AND `expires_at` > '2025-12-01 14:35:52'
---
    public function logout()
    {
        $session = \Config\Services::session();
        $user = $session->get('user');

        log_message('info', 'Logout attempt for user: ' . ($user['email'] ?? 'unknown'));

        if ($user) {
            try {
                // Deactivate sessions
                $this->sessionModel->where('user_id', $user['id'])
                    ->where('expires_at >', date('Y-m-d H:i:s'))
                    ->set(['expires_at' => date('Y-m-d H:i:s')])
                    ->update();