app/Controllers/Admin/Courses.php

    public function index()
    {
        $status = $this->request->getGet('status');
        $search = $this->request->getGet('search');

        $builder = $this->courseModel->select('courses.*, users.first_name, users.last_name, categories.name as category_name')
            ->join('users', 'users.id = courses.instructor_id', 'left')
            ->join('categories', 'categories.id = courses.category_id', 'left');

        if ($status) {
            $builder->where('courses.status', $status);
        }

        if ($search) {
            $builder->groupStart()
                ->like('courses.title', $search)
                ->orLike('courses.description', $search)
                ->orLike('users.first_name', $search)
                ->orLike('users.last_name', $search)
                ->groupEnd();
        }

        $courses = $builder->orderBy('courses.created_at', 'DESC')->findAll();
---
SELECT `courses`.*, `users`.`first_name`, `users`.`last_name`, `categories`.`name` as `category_name`
FROM `courses`
LEFT JOIN `users` ON `users`.`id` = `courses`.`instructor_id`
LEFT JOIN `categories` ON `categories`.`id` = `courses`.`category_id`
ORDER BY `courses`.`created_at` DESC

    public function update($id)
    {
        $course = $this->courseModel->find($id);
---
SELECT *
FROM `courses`
WHERE `courses`.`id` = '1'

            $data['learning_outcomes'] = json_encode(explode("\n", $this->request->getPost('learning_outcomes')));
        }

        if ($this->courseModel->update($id, $data)) {
---
UPDATE `courses` SET `title` = 'Flutter', `description` = 'This course you will learn full flutter framework', `short_description` = 'Flutter framework', `instructor_id` = '3', `category_id` = '1', `price` = '0.00', `discount_price` = '10.00', `level` = 'intermediate', `language` = 'English', `status` = 'published', `is_free` = 0, `is_featured` = 1, `thumbnail_url` = 'http://localhost/e-learning/uploads/courses/thumbnails/1764590202_8082d743b94b888d5beb.jpg', `promo_video_url` = 'http://localhost/e-learning/uploads/courses/videos/1764599405_27dbe422c4751d46f7bb.mp4', `updated_at` = '2025-12-01 14:30:05'
WHERE `courses`.`id` IN ('1')

    public function view($id)
    {
        $course = $this->courseModel->getCourseById($id);

        if (!$course) {
            return redirect()->to('admin/courses')->with('error', 'Course not found.');
        }

        // Load sections and lectures for this course
        $sectionModel = new \App\Models\SectionModel();
        $lectureModel = new \App\Models\LectureModel();
        $sections = $sectionModel->getAllSectionsByCourse($id);

        // Get lectures for each section
        $allLectures = [];
        foreach ($sections as &$section) {
            $section['lectures'] = $lectureModel->getAllLecturesBySection($section['id']);
            // Flatten lectures for easy access
            foreach ($section['lectures'] as $lecture) {
                $lecture['section_title'] = $section['title'];
                $allLectures[] = $lecture;
            }
        }

        // Get instructor info
        $instructor = $this->userModel->find($course['instructor_id']);

        // Get category info
        $category = $this->categoryModel->find($course['category_id']);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '3'
SELECT *
FROM `categories`
WHERE `categories`.`id` = '1'