app/Controllers/Admin/Courses.php

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
SELECT *
FROM `categories`
WHERE `categories`.`id` = '1'
---
    public function view($id)
    {
        $course = $this->courseModel->getCourseById($id);

        if (!$course) {
            return redirect()->to('admin/courses')->with('error', 'Course not found.');
        }

        // Load sections and lectures for this course
        $sectionModel = new \App\Models\SectionModel();
        $lectureModel = new \App\Models\LectureModel();
        $sections = $sectionModel->getAllSectionsByCourse($id);

        // Get lectures for each section
        $allLectures = [];
        foreach ($sections as &$section) {
            $section['lectures'] = $lectureModel->getAllLecturesBySection($section['id']);
            // Flatten lectures for easy access
            foreach ($section['lectures'] as $lecture) {
                $lecture['section_title'] = $section['title'];
                $allLectures[] = $lecture;
            }
        }

        // Get instructor info
        $instructor = $this->userModel->find($course['instructor_id']);

        // Get category info
        $category = $this->categoryModel->find($course['category_id']);