app/Controllers/Admin/Discussions.php

    public function index()
    {
        $courseId = $this->request->getGet('course_id');
        $postType = $this->request->getGet('post_type') ?? 'all';
        $search = $this->request->getGet('search');

        $builder = $this->discussionModel->select('discussions.*, courses.title as course_title, users.first_name, users.last_name, users.email')
            ->join('courses', 'courses.id = discussions.course_id', 'left')
            ->join('users', 'users.id = discussions.user_id', 'left');

        if ($courseId) {
            $builder->where('discussions.course_id', $courseId);
        }

        if ($postType !== 'all') {
            if ($postType === 'question') {
                $builder->where('discussions.is_question', true);
            } else {
                $builder->where('discussions.is_question', false);
            }
        }

        if ($search) {
            $builder->groupStart()
                ->like('discussions.title', $search)
                ->orLike('discussions.content', $search)
                ->orLike('courses.title', $search)
                ->groupEnd();
        }

        $discussions = $builder->orderBy('discussions.is_pinned', 'DESC')
            ->orderBy('discussions.created_at', 'DESC')
            ->findAll();

        // Get courses for filter
        $courses = $this->courseModel->select('id, title')->orderBy('title', 'ASC')->findAll();
---
SELECT `discussions`.*, `courses`.`title` as `course_title`, `users`.`first_name`, `users`.`last_name`, `users`.`email`
FROM `discussions`
LEFT JOIN `courses` ON `courses`.`id` = `discussions`.`course_id`
LEFT JOIN `users` ON `users`.`id` = `discussions`.`user_id`
WHERE `discussions`.`course_id` = '2'
AND `discussions`.`is_question` = 1
ORDER BY `discussions`.`is_pinned` DESC, `discussions`.`created_at` DESC
SELECT `id`, `title`
FROM `courses`
ORDER BY `title` ASC

    public function view($id)
    {
        $discussion = $this->discussionModel->select('discussions.*, courses.title as course_title, courses.id as course_id, users.first_name, users.last_name, users.email, users.profile_picture')
            ->join('courses', 'courses.id = discussions.course_id', 'left')
            ->join('users', 'users.id = discussions.user_id', 'left')
            ->find($id);

        if (!$discussion) {
            return redirect()->to('admin/discussions')->with('error', 'Discussion not found.');
        }

        // Get replies - check if discussion_replies table exists, otherwise use discussions table with parent_id
        $db = \Config\Database::connect();
        $tables = $db->listTables();

        if (in_array('discussion_replies', $tables)) {
            $replies = $this->replyModel->select('discussion_replies.*, users.first_name, users.last_name, users.email, users.profile_picture, users.role')
                ->join('users', 'users.id = discussion_replies.user_id', 'left')
                ->where('discussion_replies.discussion_id', $id)
                ->orderBy('discussion_replies.created_at', 'ASC')
                ->findAll();
        } else {
            // Use discussions table with parent_id for replies
            $replies = $this->discussionModel->select('discussions.*, users.first_name, users.last_name, users.email, users.profile_picture, users.role')
                ->join('users', 'users.id = discussions.user_id', 'left')
                ->where('discussions.parent_id', $id)
                ->orderBy('discussions.created_at', 'ASC')
                ->findAll();
---
SELECT `discussions`.*, `courses`.`title` as `course_title`, `courses`.`id` as `course_id`, `users`.`first_name`, `users`.`last_name`, `users`.`email`, `users`.`profile_picture`
FROM `discussions`
LEFT JOIN `courses` ON `courses`.`id` = `discussions`.`course_id`
LEFT JOIN `users` ON `users`.`id` = `discussions`.`user_id`
WHERE `discussions`.`id` = '2'
SELECT `discussions`.*, `users`.`first_name`, `users`.`last_name`, `users`.`email`, `users`.`profile_picture`, `users`.`role`
FROM `discussions`
LEFT JOIN `users` ON `users`.`id` = `discussions`.`user_id`
WHERE `discussions`.`parent_id` = '2'
ORDER BY `discussions`.`created_at` ASC

    public function togglePin($id)
    {
        $discussion = $this->discussionModel->find($id);

        if (!$discussion) {
            return redirect()->back()->with('error', 'Discussion not found.');
        }

        $this->discussionModel->update($id, [
            'is_pinned' => !$discussion['is_pinned']
        ]);
---
SELECT *
FROM `discussions`
WHERE `discussions`.`id` = '2'
UPDATE `discussions` SET `is_pinned` = 1, `updated_at` = '2025-12-02 13:44:10'
WHERE `discussions`.`id` IN ('2')

    public function toggleResolve($id)
    {
        $discussion = $this->discussionModel->find($id);

        if (!$discussion) {
            return redirect()->back()->with('error', 'Discussion not found.');
        }

        $this->discussionModel->update($id, [
            'is_resolved' => !$discussion['is_resolved']
        ]);
---
SELECT *
FROM `discussions`
WHERE `discussions`.`id` = '2'
UPDATE `discussions` SET `is_resolved` = 1, `updated_at` = '2025-12-02 13:43:51'
WHERE `discussions`.`id` IN ('2')