app/Controllers/Admin/Enrollments.php

SELECT COUNT(*) as total
FROM `lectures`
JOIN `course_sections` ON `course_sections`.`id` = `lectures`.`section_id`
WHERE `course_sections`.`course_id` = '1'
AND `lectures`.`is_published` = 1
 LIMIT 1
---
        foreach ($enrollments as &$enrollment) {
            try {
                // Get total lectures for this course
                $totalLectures = $this->lectureModel->select('COUNT(*) as total')
                    ->join('course_sections', 'course_sections.id = lectures.section_id')
                    ->where('course_sections.course_id', $enrollment['course_id'])
                    ->where('lectures.is_published', 1)
                    ->first();

SELECT `id`, `title`
FROM `courses`
ORDER BY `title` ASC
---
        }

        // Get courses for filter dropdown
        $courses = $this->courseModel->select('id, title')->orderBy('title', 'ASC')->findAll();