app/Controllers/Admin/Users.php

    public function index()
    {
        $role = $this->request->getGet('role');
        $search = $this->request->getGet('search');

        $builder = $this->userModel;

        if ($role) {
            $builder->where('role', $role);
        }

        if ($search) {
            $builder->groupStart()
                ->like('first_name', $search)
                ->orLike('last_name', $search)
                ->orLike('email', $search)
                ->groupEnd();
        }

        $users = $builder->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `created_at` DESC