app/Controllers/Portal/Courses.php

SELECT *
FROM `categories`
WHERE `is_active` = 1
---
        }

        $courses = $builder->findAll();
        $categories = $this->categoryModel->where('is_active', 1)->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
SELECT *
FROM `categories`
WHERE `categories`.`id` = '1'
---
    public function view($id)
    {
        $course = $this->courseModel->getCourseById($id);

        if (!$course || $course['status'] !== 'published') {
            return redirect()->to('courses')->with('error', 'Course not found.');
        }

        // Get instructor
        $instructor = $this->userModel->find($course['instructor_id']);

        // Get category
        $category = $this->categoryModel->find($course['category_id']);