app/Controllers/Portal/Dashboard.php

    public function index()
    {
        $session = \Config\Services::session();
        $user = $session->get('user');

        if (!$user || $user['role'] !== 'student') {
            return redirect()->to('portal/login');
        }

        // Get user's enrollments
        $enrollments = $this->enrollmentModel->select('enrollments.*, courses.title, courses.thumbnail_url, courses.instructor_id, users.first_name, users.last_name')
            ->join('courses', 'courses.id = enrollments.course_id')
            ->join('users', 'users.id = courses.instructor_id', 'left')
            ->where('enrollments.user_id', $user['id'])
            ->orderBy('enrollments.enrolled_at', 'DESC')
            ->findAll();
---
SELECT `enrollments`.*, `courses`.`title`, `courses`.`thumbnail_url`, `courses`.`instructor_id`, `courses`.`total_lectures`, `users`.`first_name`, `users`.`last_name`, `orders`.`status` as `order_status`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
LEFT JOIN `users` ON `users`.`id` = `courses`.`instructor_id`
LEFT JOIN `orders` ON `orders`.`id` = `enrollments`.`order_id`
WHERE `enrollments`.`user_id` = '5'
ORDER BY `enrollments`.`enrolled_at` DESC

    public function myCourses()
    {
        $session = \Config\Services::session();
        $user = $session->get('user');

        if (!$user || $user['role'] !== 'student') {
            return redirect()->to('portal/login');
        }

        $enrollments = $this->enrollmentModel->select('enrollments.*, courses.title, courses.thumbnail_url, courses.instructor_id, courses.total_duration, courses.total_lectures, users.first_name, users.last_name')
            ->join('courses', 'courses.id = enrollments.course_id')
            ->join('users', 'users.id = courses.instructor_id', 'left')
            ->where('enrollments.user_id', $user['id'])
            ->orderBy('enrollments.enrolled_at', 'DESC')
            ->findAll();
---
SELECT `enrollments`.*, `courses`.`title`, `courses`.`thumbnail_url`, `courses`.`instructor_id`, `courses`.`duration_hours`, `courses`.`total_lectures`, `users`.`first_name`, `users`.`last_name`, `orders`.`status` as `order_status`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
LEFT JOIN `users` ON `users`.`id` = `courses`.`instructor_id`
LEFT JOIN `orders` ON `orders`.`id` = `enrollments`.`order_id`
WHERE `enrollments`.`user_id` = '4'
ORDER BY `enrollments`.`enrolled_at` DESC