app/Controllers/Portal/Dashboard.php

SELECT COUNT(*) as total
FROM `lectures`
JOIN `course_sections` ON `course_sections`.`id` = `lectures`.`section_id`
WHERE `course_sections`.`course_id` = '1'
AND `lectures`.`is_published` = 1
 LIMIT 1
---
    public function index()
    {
        $session = \Config\Services::session();
        $user = $session->get('user');

        if (!$user || $user['role'] !== 'student') {
            return redirect()->to('portal/login');
        }

        // Get user's enrollments with order status
        $enrollments = $this->enrollmentModel->select('enrollments.*, courses.title, courses.thumbnail_url, courses.instructor_id, courses.total_lectures, users.first_name, users.last_name, orders.status as order_status')
            ->join('courses', 'courses.id = enrollments.course_id')
            ->join('users', 'users.id = courses.instructor_id', 'left')
            ->join('orders', 'orders.id = enrollments.order_id', 'left')
            ->where('enrollments.user_id', $user['id'])
            ->orderBy('enrollments.enrolled_at', 'DESC')
            ->findAll();

        // Calculate progress for each enrollment
        foreach ($enrollments as &$enrollment) {
            if (empty($enrollment['order_status']) || $enrollment['order_status'] === 'completed') {
                // Get total lectures for this course
                $totalLectures = $this->lectureModel->select('COUNT(*) as total')
                    ->join('course_sections', 'course_sections.id = lectures.section_id')
                    ->where('course_sections.course_id', $enrollment['course_id'])
                    ->where('lectures.is_published', 1)
                    ->first();