app/Controllers/Portal/Home.php

SELECT *
FROM `courses`
WHERE `is_featured` = 1
AND `status` = 'published'
ORDER BY `created_at` DESC
 LIMIT 6
SELECT *
FROM `courses`
WHERE `status` = 'published'
ORDER BY `total_students` DESC
 LIMIT 6
SELECT *
FROM `categories`
WHERE `is_active` = 1
ORDER BY `name` ASC
SELECT *
FROM `courses`
WHERE `status` = 'published'
ORDER BY `created_at` DESC
 LIMIT 8
---
    public function index()
    {
        try {
            // Get featured courses
            $featuredCourses = $this->courseModel->where('is_featured', 1)
                ->where('status', 'published')
                ->orderBy('created_at', 'DESC')
                ->limit(6)
                ->findAll();

            // Get popular courses (by student count)
            $popularCourses = $this->courseModel->where('status', 'published')
                ->orderBy('total_students', 'DESC')
                ->limit(6)
                ->findAll();

            // Get categories
            $categories = $this->categoryModel->where('is_active', 1)
                ->orderBy('name', 'ASC')
                ->findAll();

            // Get recent courses
            $recentCourses = $this->courseModel->where('status', 'published')
                ->orderBy('created_at', 'DESC')
                ->limit(8)
                ->findAll();