app/Controllers/Portal/Learn.php

SELECT *
FROM `enrollments`
WHERE `user_id` = '4'
AND `course_id` = '1'
 LIMIT 1
SELECT *
FROM `orders`
WHERE `orders`.`id` = '1'
---
    public function index($courseId)
    {
        $session = \Config\Services::session();
        $user = $session->get('user');

        if (!$user || $user['role'] !== 'student') {
            return redirect()->to('portal/login')->with('error', 'Please login to access courses.');
        }

        // Check enrollment
        $enrollment = $this->enrollmentModel->where('user_id', $user['id'])
            ->where('course_id', $courseId)
            ->first();

        if (!$enrollment) {
            return redirect()->to('courses/' . $courseId)->with('error', 'You must enroll in this course first.');
        }

        // Check order status if enrollment has order_id
        if (!empty($enrollment['order_id'])) {
            $order = $this->orderModel->find($enrollment['order_id']);