app/Views/admin/discussions/index.php

SELECT COUNT(*) AS `numrows`
FROM `discussions`
WHERE `parent_id` = '2'
---
                                            } else {
                                                // Use discussions table with parent_id
                                                $discussionModel = new \App\Models\DiscussionModel();
                                                $replyCount = $discussionModel->where('parent_id', $discussion['id'])->countAllResults();