app/Filters/AdminAuth.php


        // Verify user is still active
        $userModel = new UserModel();
        $currentUser = $userModel->find($user['id']);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'