app/Models/CategoryModel.php

SELECT *
FROM `categories`
WHERE `is_active` = 1
---
    public function getActiveCategories()
    {
        return $this->where('is_active', true)->findAll();