app/Models/CourseModel.php

SELECT `courses`.*, `users`.`first_name`, `users`.`last_name`, `users`.`profile_picture`, `categories`.`name` as `category_name`
FROM `courses`
LEFT JOIN `users` ON `users`.`id` = `courses`.`instructor_id`
LEFT JOIN `categories` ON `categories`.`id` = `courses`.`category_id`
WHERE `courses`.`id` = '2'
 LIMIT 1
---
    public function getCourseById($courseId)
    {
        return $this->select('courses.*, users.first_name, users.last_name, users.profile_picture, categories.name as category_name')
            ->join('users', 'users.id = courses.instructor_id', 'left')
            ->join('categories', 'categories.id = courses.category_id', 'left')
            ->where('courses.id', $courseId)
            ->first();