app/Models/LectureModel.php

    public function getAllLecturesBySection($sectionId)
    {
        return $this->where('section_id', $sectionId)
            ->orderBy('order_index', 'ASC')
            ->findAll();
---
SELECT *
FROM `lectures`
WHERE `section_id` = '2'
ORDER BY `order_index` ASC