app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'admin@elooxacademy.com'
 LIMIT 1
---
    public function getUserByEmail($email)
    {
        return $this->where('email', $email)->first();

SELECT *
FROM `users`
WHERE `role` = 'instructor'
AND `is_active` = 1
---
    public function getInstructorUsers()
    {
        return $this->where('role', 'instructor')->where('is_active', true)->findAll();