app/Views/layouts/base.php

                            $userModel = new \App\Models\UserModel();

                            // Get all admin users
                            $adminUsers = $userModel->where('role', 'admin')->findAll();
---
SELECT *
FROM `users`
WHERE `role` = 'admin'


                                // Get unread count
                                $unreadBuilder = $db->table('notifications');
                                $unreadCount = $unreadBuilder->whereIn('user_id', $adminIds)
                                    ->where('is_read', false)
                                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` IN ('1','1')
AND `is_read` = 0